/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	main.c
	*
	*	作者： 		张继瑞
	*
	*	日期： 		2017-05-08
	*
	*	版本： 		V1.0
	*
	*	说明： 		接入onenet，上传数据和命令控制
	*
	*	修改记录：
	************************************************************
	************************************************************
	************************************************************
**/

//单片机头文件
#include "stm32f10x.h"

//网络协议层
#include <onenet.h>

//网络设备
#include <esp8266.h>

//硬件驱动
#include "delay.h"
#include "usart.h"
#include "led.h"


//C库
#include <string.h>


#define ESP8266_ONENET_INFO		"AT+CIPSTART=\"TCP\",\"183.230.40.96\",1883\r\n"


/*
************************************************************
*	函数名称：	Hardware_Init
*
*	函数功能：	硬件初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：		初始化单片机功能以及外接设备
************************************************************
*/
void Hardware_Init(void)
{
	Delay_Init();
	Led_Init();							//LED初始化

}

/*
************************************************************
*	函数名称：	main
*
*	函数功能：
*
*	入口参数：	无
*
*	返回参数：	0
*
*	说明：
************************************************************
*/
int main(void)
{

	Hardware_Init();	//初始化外围硬件
	while(1)
	{
	GPIO_WriteBit(GPIOC, GPIO_Pin_13, Bit_RESET);//点亮LED
	DelayMs(500);
	GPIO_WriteBit(GPIOC, GPIO_Pin_13, Bit_SET);//熄灭LED
	DelayMs(500);
	}

}
